/*选择区域浮层*/
$('.p3_quyu').click(function() {
    $('.p3_dai').show();
})

/*关闭区域浮层*/
$('.p3_close').click(function() {
    $('.p3_dai').hide();
})
//区域选择
$('.p3_dai li').click(function(){
    $('.p3_dai').hide();
})
$('#fenxiBtn3').click(function(){
	$('.container').show();
});
layui.use('form', function() {
    var form = layui.form;

    layui.use('laydate', function() {
        var laydate = layui.laydate;
        //常规用法
        laydate.render({
            elem: '#p3_test1',
        });

        laydate.render({
            elem: '#p3_test2',
        });
    })
})
var data =[
	[1,'0-6点','闲','10块以下','地铁口','阴','畅通','1人'],
	[1,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [1,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [1,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [1,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [1,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [1,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [1,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [2,'6-8点','正常','10块以上','商圈','晴','拥堵','3人'],
    [2,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [2,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [2,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [2,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [2,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [2,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [2,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [3,'11-13点','闲','5块','学校','雪','拥堵','4人及以上'],
    [3,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [3,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [3,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [3,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [3,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [3,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [3,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [4,'13-15点','正常','5块以下','学校','阴','拥堵','1人'],
    [4,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [4,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [4,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [4,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [4,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [4,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [4,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [5,'18-21点','正常','5块','地铁口','晴','畅通','3人'],
    [5,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [5,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [5,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [5,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [5,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [5,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [5,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [6,'21-0点','闲','10块以上','商圈','晴','畅通','1人'],
    [6,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [6,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [6,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [6,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [6,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [6,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [6,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [7,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [7,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [7,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [7,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [7,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [7,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [7,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [8,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [8,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [8,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [8,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [8,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [8,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [8,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [9,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [9,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [9,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [9,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [9,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [9,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [9,'15-18点','忙','10块','车站','雨','较堵','2人'],
    [9,'15-18点','忙','10块','车站','雨','畅通','4人及以上'],
    
    [10,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [10,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [10,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [10,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [10,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [10,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [10,'15-18点','忙','10块','车站','雨','较堵','2人'],
    [10,'15-18点','忙','10块','车站','雨','拥堵','2人'],
    
    
    [11,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [11,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [11,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [11,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [11,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [11,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [11,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [12,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [12,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [12,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [12,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [12,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [12,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [12,'15-18点','忙','10块','车站','雨','较堵','2人'],
    [12,'15-18点','忙','5块以下','车站','阴','较堵','1人'],
    
    [13,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [13,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [13,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [13,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [13,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [13,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [13,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [14,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [14,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [14,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [14,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [14,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [14,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [14,'15-18点','忙','10块','车站','雨','较堵','2人'],
    [14,'15-18点','忙','5块以下','商圈','阴','畅通','1人'],
    
    [15,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [15,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [15,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [15,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [15,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [15,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [15,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [16,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [16,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [16,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [16,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [16,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [16,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [16,'15-18点','忙','10块','车站','雨','较堵','2人'],
    [16,'15-18点','忙','5块','商圈','雪','畅通','2人'],
    
    [16,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [16,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [16,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [16,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [16,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [16,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [16,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [17,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [17,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [17,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [17,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [17,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [17,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [17,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [18,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [18,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [18,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [18,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [18,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [18,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [18,'15-18点','忙','10块','车站','雨','较堵','2人'],
    [18,'15-18点','忙','10块','学校','雨','较堵','2人'],
    
    [19,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [19,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [19,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [19,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [19,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [19,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [19,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [20,'6-8点','极忙','5块','学校','雨','拥堵','3人'],
    [20,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [20,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [20,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [20,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [20,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [20,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [20,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [21,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [21,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [21,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [21,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [21,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [21,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [21,'15-18点','忙','10块','车站','雨','较堵','2人'],
    [21,'15-18点','忙','5块','地铁口','雨','畅通','1人'],
    
    [22,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [22,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [22,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [22,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [22,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [22,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [22,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [23,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [23,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [23,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [23,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [23,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [23,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [23,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [24,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [24,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [24,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [24,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [24,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [24,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [24,'15-18点','忙','10块','车站','雨','较堵','2人'],
    [24,'21-0点','极忙','10块','车站','雨','较堵','2人'],
    
    [25,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [25,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [25,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [25,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [25,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [25,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [25,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [26,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [26,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [26,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [26,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [26,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [26,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [26,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [27,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [27,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [27,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [27,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [27,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [27,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [27,'15-18点','忙','10块','车站','雨','较堵','2人'],
    [27,'18-21点','极忙','10块','车站','雨','较堵','2人'],
    
    [28,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [28,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [28,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [28,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [28,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [28,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [28,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [29,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [29,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [29,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [29,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [29,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [29,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [29,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    [30,'8-11点','闲','5块','学校','阴','畅通','1人'],
    [30,'15-18点','正常','5块以下','地铁口','雪','较堵','4人及以上'],
    [30,'8-11点','极忙','10块以上','商圈','晴','拥堵','3人'],
    [30,'8-11点','极忙','10块','商圈','晴','拥堵','3人'],
    [30,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [30,'8-11点','极忙','10块','车站','晴','拥堵','3人'],
    [30,'15-18点','忙','10块以上','商圈','晴','较堵','2人'],
    [30,'15-18点','忙','10块','商圈','晴','较堵','2人'],
    [30,'15-18点','忙','10块','车站','雨','较堵','2人'],
    
    
    
    
    
    
    
]
var data2 =[
    {value:4, name:'0-6点'},
    {value:28, name:'6-8点'},
    {value:117, name:'8-11点'},
    {value:3, name:'11-13点'},
    {value:1, name:'13-15点'},
    {value:93, name:'15-18点'},
    {value:6, name:'18-21点'},
    {value:3, name:'21-0点'}
];
var data3 =[
    {value:8, name:'闲'},
    {value:39, name:'正常'},
    {value:91, name:'忙'},
    {value:124, name:'极忙'},
  
];
var data4 =[
    {value:61, name:'10块以上'},
    {value:115, name:'10块'},
    {value:67, name:'10块'},
    {value:14, name:'5块以下'},
  
];
var data5 =[
    {value:125, name:'商圈'},
    {value:121, name:'车站'},
    {value:6, name:'学校'},
    {value:3, name:'地铁口'},
  
];
var data6 =[
    {value:186, name:'晴'},
    {value:6, name:'阴'},
    {value:56, name:'雨'},
    {value:6, name:'雪'},
  
];
var data7 =[
    {value:7, name:'畅通'},
    {value:11, name:'较堵'},
    {value:237, name:'拥堵'},
  
];
var data8 =[
    {value:174, name:'1人'},
    {value:59, name:'2人'},
    {value:16, name:'3人'},
    {value:5, name:'4人及以上'},
  
];
var schema = [
    {name: '日期', index: 0, text: '日期'},
    {name: '时间段', index: 1, text: '时间段'},
    {name: '周边泊车位忙闲程度', index: 2, text: '周边泊车位忙闲程度'},
    {name: '周边停车点费用', index: 3, text: '周边停车点费用'},
    {name: '所处区域类型', index: 4, text: '所处区域类型'},
    {name: '天气情况', index: 5, text: '天气情况'},
    {name: '周边道路拥堵情况', index: 6, text: '周边道路拥堵情况'},
    {name: '周边城管执法人员', index: 7, text: '周边城管执法人员'}
];

var lineStyle = {
    normal: {
        width: 2,
    }
};

var page3_chart = echarts.init(document.getElementById("page3_chart"));
option = {
    tooltip : {
        trigger: 'item',
        formatter: "{a} <br/>{b} : {c} ({d}%)"
    },
    title: {
        text: '违停事件',
        left: 'center',
        textStyle: {
            color: '#fff'
        }
    },
    parallelAxis: [
        {dim: 0, name: schema[0].text, inverse: true,min:1, max: 30, nameLocation: 'start'},
        {dim: 1, name: schema[1].text,type: 'category', data: ['21-0点','18-21点','15-18点','13-15点','11-13点','8-11点','6-8点', '0-6点']},
        {dim: 2, name: schema[2].text,type: 'category', data: ['极忙', '忙', '正常', '闲']},
        {dim: 3, name: schema[3].text,type: 'category', data: ['10块以上', '10块', '5块', '5块以下']},
        {dim: 4, name: schema[4].text,type: 'category', data: ['商圈', '车站', '学校', '地铁口']},
        {dim: 5, name: schema[5].text,type: 'category', data: ['晴', '阴', '雨','雪']},
        {dim: 6, name: schema[6].text,type: 'category', data: ['拥堵','较堵','畅通']},
        {dim: 7, name: schema[7].text,type: 'category', data: ['4人及以上', '3人', '2人','1人']}
    ],
    parallel: {
        top:100,
        bottom: 200,
        parallelAxisDefault: {
            type: 'value',
            name: '违停事件',
            nameLocation: 'end',
            nameGap: 20,
            nameTextStyle: {
                color: '#fff',
                fontSize: 12
            },
            axisLine: {
                lineStyle: {
                    color: '#aaa'
                }
            },
            axisTick: {
                lineStyle: {
                    color: '#777'
                }
            },
            splitLine: {
                show: false
            },
            axisLabel: {
                textStyle: {
                    color: '#fff'
                }
            }
        }
    },
        
    series: [
        {
            name: '违停事件',
            type: 'parallel',
            lineStyle: lineStyle,
            data: data
        },
        {
            name: '时间段',
            type: 'pie',
            radius : '15%',
            center: ['19%', '77%'],
            z: 100,
            data:data2,
            label: {
                normal: {
                    show:false,
                    position: 'inner',
                    formatter: '{d}%',
                }
            },
    
        },
        {
            name: '周边泊车位忙闲程度',
            type: 'pie',
            radius : '15%',
            center: ['32%', '77%'],
            z: 100,
            data:data3,
            label: {
                normal: {
                    show:false,
                    position: 'inner',
                    formatter: '{d}%',
                }
            },
    
        },
        {
            name: '周边停车点费用',
            type: 'pie',
            radius : '15%',
            center: ['44%', '77%'],
            z: 100,
            data:data4,
            label: {
                normal: {
                    show:false,
                    position: 'inner',
                    formatter: '{d}%',
                }
            },
    
        },
        {
            name: '所处区域类型',
            type: 'pie',
            radius : '15%',
            center: ['56%', '77%'],
            z: 100,
            data:data5,
            label: {
                normal: {
                    show:false,
                    position: 'inner',
                    formatter: '{d}%',
                }
            },
    
        },
        {
            name: '天气情况',
            type: 'pie',
            radius : '15%',
            center: ['69%', '77%'],
            z: 100,
            data:data6,
            label: {
                normal: {
                    show:false,
                    position: 'inner',
                    formatter: '{d}%',
                }
            },
    
        },
        {
            name: '周边道路拥堵情况',
            type: 'pie',
            radius : '15%',
            center: ['81%', '77%'],
            z: 100,
            data:data7,
            label: {
                normal: {
                    show:false,
                    position: 'inner',
                    formatter: '{d}%',
                }
            },
    
        },
         {
            name: '周边城管执法人员',
            type: 'pie',
            radius : '15%',
            center: ['93%', '77%'],
            z: 100,
            data:data8,
            label: {
                normal: {
                    show:false,
                    position: 'inner',
                    formatter: '{d}%',
                }
            },
    
        }
        

    ]
};
page3_chart.setOption(option);