var data = [{
		"sw": 120.185113,
		"ne": 30.179931,
		"tit": "彩虹大厦"
	},
	{
		"sw": 120.192875,
		"ne": 30.185176,
		"tit": "长江小区"
	},
	{
		"sw": 120.174423,
		"ne": 30.190998,
		"tit": "江南大道"
	},
	{
		"sw": 120.191383,
		"ne": 30.178761,
		"tit": "滨文路"
	},
	{
		"sw": 120.174208,
		"ne": 30.173703,
		"tit": "火炬大道"
	},
	{
		"sw": 120.188725,
		"ne": 30.187689,
		"tit": "滨康路"
	},
	{
		"sw": 120.165656,
		"ne": 30.188064,
		"tit": "伟业路"
	},
	{
		"sw": 120.16041,
		"ne": 30.178698,
		"tit": "滨文路2"
	},
	{
		"sw": 120.19203,
		"ne": 30.177262,
		"tit": "西湘路"
	},
	{
		"sw": 120.195839,
		"ne": 30.185566,
		"tit": "长江路2"
	},
	{
		"sw": 120.1771,
		"ne": 30.169597,
		"tit": "火炬大道辅路"
	},
]
var data2 = [{
		"sw": 120.201858,
		"ne": 30.18349,
		"tit": "铂金名筑"
	},
	{
		"sw": 120.217416,
		"ne": 30.182476,
		"tit": "南环路"
	},
	{
		"sw": 120.21562,
		"ne": 30.186409,
		"tit": "滨康小区"
	},
	{
		"sw": 120.203044,
		"ne": 30.188032,
		"tit": "江虹路西"
	},
	{
		"sw": 120.177172,
		"ne": 30.190967,
		"tit": "长健大厦"
	},
	{
		"sw": 120.164596,
		"ne": 30.176419,
		"tit": "立业园"
	},
	{
		"sw": 120.199953,
		"ne": 30.198583,
		"tit": "滨兴家园"
	},
	{
		"sw": 120.188096,
		"ne": 30.194401,
		"tit": "华盛达广场"
	},
	{
		"sw": 120.162368,
		"ne": 30.195087,
		"tit": "彩虹城"
	}

]
var dataAll_1 = [{
		"sw": 120.165638,
		"ne": 30.179744201858
	},
	{
		"sw": 120.171028,
		"ne": 30.179494217416
	},
	{
		"sw": 120.169734,
		"ne": 30.179557

	},
	{
		"sw": 120.175627,
		"ne": 30.179432

	},
	{
		"sw": 120.185616,
		"ne": 30.179182
	},
	{

		"sw": 120.192731,
		"ne": 30.179682
	},
	{

		"sw": 120.161973,
		"ne": 30.179682
	},
	{

		"sw": 120.171459,
		"ne": 30.17912
	},
	{

		"sw": 120.155361,
		"ne": 30.178682
	},
	{
		"sw": 120.158901,
		"ne": 30.197666
	},
	{
		"sw": 120.157672,
		"ne": 30.19056
	},
	{
		"sw": 120.155974,
		"ne": 30.187345

	},
	{
		"sw": 120.158901,
		"ne": 30.197666
	},
	{

		"sw": 120.152496,
		"ne": 30.182992
	},
	{

		"sw": 120.141231,
		"ne": 30.182416
	},
	{

		"sw": 120.159079,
		"ne": 30.193984
	},
	{

		"sw": 120.136973,
		"ne": 30.182359
	}
]
var dataAll_2 = [{
		"sw": 120.179053,
		"ne": 30.179571
	},
	{
		"sw": 120.199547,
		"ne": 30.178862
	},
	{
		"sw": 120.19484,
		"ne": 30.178528

	},
	{
		"sw": 120.173801,
		"ne": 30.179262
	},
	{

		"sw": 120.147973,
		"ne": 30.176317
	},
	{

		"sw": 120.200734,
		"ne": 30.18025
	},
	{

		"sw": 120.203908,
		"ne": 30.179167
	},
	{

		"sw": 120.153806,
		"ne": 30.178159,
	},
	{
		"sw": 120.158464,
		"ne": 30.192784
	},
	{
		"sw": 120.158321,
		"ne": 30.192222
	},
	{
		"sw": 120.157027,
		"ne": 30.189412

	},
	{
		"sw": 120.154224,
		"ne": 30.185604
	},
	{

		"sw": 120.153578,
		"ne": 30.184417
	},
	{

		"sw": 120.149984,
		"ne": 30.182419
	},
	{

		"sw": 120.145385,
		"ne": 30.182419
	},
	{

		"sw": 120.158824,
		"ne": 30.196717
	}
]
var data_bw1 = [{
		"sw": 120.165638,
		"ne": 30.179744201858
	},
	{
		"sw": 120.171028,
		"ne": 30.179494217416
	},
	{
		"sw": 120.169734,
		"ne": 30.179557

	},
	{
		"sw": 120.175627,
		"ne": 30.179432

	},
	{
		"sw": 120.185616,
		"ne": 30.179182
	},
	{

		"sw": 120.192731,
		"ne": 30.179682
	},
	{

		"sw": 120.161973,
		"ne": 30.179682
	},
	{

		"sw": 120.171459,
		"ne": 30.17912
	},
	{

		"sw": 120.155361,
		"ne": 30.178682
	}

]
var data_dx1 = [{
		"sw": 120.158901,
		"ne": 30.197666
	},
	{
		"sw": 120.157672,
		"ne": 30.19056
	},
	{
		"sw": 120.155974,
		"ne": 30.187345

	},
	{
		"sw": 120.158901,
		"ne": 30.197666
	},
	{

		"sw": 120.152496,
		"ne": 30.182992
	},
	{

		"sw": 120.141231,
		"ne": 30.182416
	},
	{

		"sw": 120.159079,
		"ne": 30.193984
	},
	{

		"sw": 120.136973,
		"ne": 30.182359
	}

]
var data_bw2 = [{
		"sw": 120.179053,
		"ne": 30.179571
	},
	{
		"sw": 120.199547,
		"ne": 30.178862
	},
	{
		"sw": 120.19484,
		"ne": 30.178528

	},
	{
		"sw": 120.173801,
		"ne": 30.179262
	},
	{

		"sw": 120.147973,
		"ne": 30.176317
	},
	{

		"sw": 120.200734,
		"ne": 30.18025
	},
	{

		"sw": 120.203908,
		"ne": 30.179167
	},
	{

		"sw": 120.153806,
		"ne": 30.178159,
	}

]
var data_dx2 = [{
		"sw": 120.158464,
		"ne": 30.192784
	},
	{
		"sw": 120.158321,
		"ne": 30.192222
	},
	{
		"sw": 120.157027,
		"ne": 30.189412

	},
	{
		"sw": 120.154224,
		"ne": 30.185604
	},
	{

		"sw": 120.153578,
		"ne": 30.184417
	},
	{

		"sw": 120.149984,
		"ne": 30.182419
	},
	{

		"sw": 120.145385,
		"ne": 30.182419
	},
	{

		"sw": 120.158824,
		"ne": 30.196717
	}

]
var marker_1 = 0;
var marker_2 = 1;

var listMarker_1 = [];
var listMarker_2 = [];
$('#fenxiBtn2').click(function(){
	$('.container').show();
	map();
	page2_bar_top1();
	page2_bar_bottom1();

})
var btn2 = document.getElementById('fenxiBtn2');
function map(){
	var map = new BMap.Map("page2_chart");
	var point = new BMap.Point(120.181735,30.178588);
	map.centerAndZoom(point, 14);
	map.enableScrollWheelZoom(true);
	
	buildMarker(dataAll_1, marker_1);
	buildMarker(dataAll_2, marker_2);

	function addMarker(point, ctgry) {
		var marker = point
		var icon = new BMap.Icon("img/wt.png", new BMap.Size(30, 37));
		marker = new BMap.Marker(point, {
			icon: icon
		});
		map.addOverlay(marker);
		marker.show();
	
		if (ctgry == 0) {
			listMarker_1.push(marker);
		} else if (ctgry == 1) {
			listMarker_2.push(marker);
		}
	}
	
	function buildMarker(data, ctgry) {
		for (var i = 0; i < data.length; i++) {
			var point = new BMap.Point(data[i].sw, data[i].ne);
			addMarker(point, ctgry);
		}
	}
}

//	clickBtn();
//var flag = true;
//function clickBtn(){
//	$('#fenxiBtn2').click(function () {
//		var list = listMarker_1;
//		var list2 = listMarker_2;
//		$('#p2_test1').val('');
//		$('#p2_test2').val('');
//		if (flag) {
//			for (var i = 0; i < list.length; i++) {
//				list[i].hide();
//			};
//			for (var i = 0; i < list2.length; i++) {
//				list2[i].show();
//			}
//			flag = false;
//		} else {
//			for (var i = 0; i < list.length; i++) {
//				list[i].show();
//			};
//			for (var i = 0; i < list2.length; i++) {
//				list2[i].hide();
//			}
//			flag = true;
//		}
//	})
//}



$('.p2_dai li').click(function(){
	$('.p2_dai').hide();
})
